testCases/Feindt/kOmegaSSTLMRough.Langel2017/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../params.in"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    lowerWall
    {
      //type            kLowReWallFunction;
      type            fixedValue;
      value           uniform 0;
    }
    lowerSymmetry
    {
        type            slip;
    }
    upperSymmetry
    {
        type            slip;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       $ITU;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        outletValue     $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
